#+title: biblio manuscript
#+author: Maxime Gaide

* Historique de la modélisation
** Courbes et surfaces paramétriques
#+TBLNAME: Courbes et surfaces paramétriques
#+STARTUP: shrink
|---+---------------------+--------+------|
|   | title               | author | year |
|---+---------------------+--------+------|
| 0 | Courbes et surfaces | Bézier | 1986 |
|---+---------------------+--------+------|
#+TBLFM: $1=(@#-2)

** Infographie
#+TBLNAME: Infographie
#+STARTUP: shrink
|---+--------------------------------------------+---------+------|
|   | title                                      | author  | year |
|---+--------------------------------------------+---------+------|
| 0 | A review of computer graphics publications | Benest  | 1979 |
| 1 | Picture-driven animation                   | Baecker | 1969 |
|---+--------------------------------------------+---------+------|
#+TBLFM: $1=(@#-2)

** Méthodes d'éléments finis
#+TBLNAME: Méthodes d'éléments finis
#+STARTUP: shrink
|----+-------+--------------+------|
| -1 | title | first author | year |
|----+-------+--------------+------|
|----+-------+--------------+------|
#+TBLFM: $1=(@#-2)

** Modeleurs contemporains
#+TBLNAME: Modeleurs contemporains
#+STARTUP: shrink
|----+-------+--------------+------|
| -1 | title | first author | year |
|----+-------+--------------+------|
|----+-------+--------------+------|
#+TBLFM: $1=(@#-2)

* Modélisation géométrique

* Nommage persistant

#+TBLNAME: nommage persistant
#+STARTUP: shrink
|----+-------+-----------------+------|
|    | title | authors         | year |
|----+-------+-----------------+------|
|  1 |       | Capoyleas       |      |
|  2 |       | Kripac          |      |
|  3 |       | Wu              |      |
|  4 |       | Bidarra         |      |
|  5 |       | Baba Ali et al. |      |
|  6 |       | Cheon           |      |
|  7 |       | Farjana et al.  |      |
|  8 |       | Mun et al.      |      |
|  9 |       | Marcheix        |      |
| 10 |       | Agbodan         |      |
|----+-------+-----------------+------|
#+TBLFM: $1=(@#-1)

* À lire/ranger/découper

#+TBLNAME: nommage persistant
#+STARTUP: shrink
|----+------------------------------------------------------------------------------------------------------------------------------+----------------+------|
|    | title                                                                                                                        | first author   | year |
|----+------------------------------------------------------------------------------------------------------------------------------+----------------+------|
|  0 | Topological models for boundary representation: a comparison with n-dimensional generalized maps                             | Lienhardt      | 1991 |
|  1 | N-dimensional generalized combinatorial maps and cellular quasi-manifolds                                                    | Lienhardt      | 1994 |
|  2 | A mechanism for persistently naming topological entities in history-based parametric solid models                            | Kripac         | 1995 |
|  3 | Generic naming in generative, constraint-based design                                                                        | Capoyleas      | 1996 |
|  4 | Semantic feature modelling                                                                                                   | Bidarra        | 2000 |
|  5 | Identification of topological entities and naming mapping for parametric cad model exchange                                  | Mun            | 2005 |
|  6 | A persistent naming of shell                                                                                                 | Marcheix       | 2006 |
|  7 | Generic computation of bulletin boards into geometric kernels                                                                | Baba-Ali       | 2007 |
|  8 | Tracking topological changes in parametric models                                                                            | Van der Meiden | 2010 |
|  9 | Name matching method using topology merging and splitting history for exchange of feature-based CAD models                   | SU Cheon       | 2012 |
| 10 | Graph transformation library for topology-based geometric modeling                                                           | Belhaouari     | 2014 |
| 11 | Enhancements for Improved Topological Entity Identification Performance in Multi-user CAD                                    | Hepworth       | 2015 |
| 12 | General physical-topological framework using rule-based language for physical simulation                                     | Ben Salah      | 2017 |
| 13 | Subdividing triangular and quadrilateral meshes in parallel to approximate curved geometries                                 | Gargallo-Peiro | 2017 |
| 14 | Mechanisms of persistent identification of topological entities in CAD systems: A review                                     | Farjana        | 2018 |
| 15 | AlSub: fully parallel and modular subdivision                                                                                | Mlakar         | 2018 |
| 16 | Persistent naming based on graph transformation rules to reevaluate parametric specification                                 | Cardot         | 2019 |
| 17 | Push-Pull Direct Modeling of Solid CAD Models                                                                                | Qiang Zou      | 2019 |
| 18 | Assembly Solving for Neutral Re-Imported Product Models                                                                      | Jauhar         | 2020 |
| 19 | Transparent Parallelization of Enrichment Operations in Geometric Modeling                                                   | Bourquat       | 2020 |
| 20 | Cooperative versus non-cooperative parallel variable neighborhood search strategies                                          | kalatzanonakis | 2020 |
| 21 | Point-oriented persistent identification of entities for exchanging parametric CAD data                                      | Safdar         | 2020 |
| 22 | Feature-based translation of CAD models with macro-parametric approach                                                       | Safdar         | 2020 |
| 23 | Reconstructing editable prismatic CAD from rounded voxel models                                                              | Lambourne      | 2022 |
| 24 | ComplexGen: CAD reconstruction by B-rep chain complex generation                                                             | H. Guo         | 2022 |
| 25 | 3D convolutional neural network for machining feature recognition with gradient-based visual explanations from 3D CAD models | J.Lee          | 2022 |
| 26 | Inferring topological operations on generalized maps: Application to subdivision schemes                                     | Pascual        | 2022 |
| 27 | Towards computing complete parameter ranges in parametric modeling                                                           | Tang           | 2022 |
| 28 | Differentiable 3d cad programs for bidirectional editing                                                                     | Cascaval       | 2022 |
| 29 | Query-replace operations for topologically controlled 3D mesh editing                                                        | Damiand        | 2022 |
| 30 | A robust direct modeling method for quadric B-rep models based on geometry-topology inconsistency tracking                   | Qiang Zou      | 2022 |
| 31 | Variational Direct Modeling: A framework towards integration of parametric modeling and direct modeling in CAD               | Qiang Zou      | 2023 |
|----+------------------------------------------------------------------------------------------------------------------------------+----------------+------|
#+TBLFM: $1=(@#-2)

* Points de lectures

** Topological models for boundary representation: a comparison with n-dimensional generalized maps
Notion de base -> g-cartes
** N-dimensional generalized combinatorial maps and cellular quasi-manifolds
Notion de base -> g-cartes
** A mechanism for persistently naming topological entities in history-based parametric solid models
nommage persistant, modélisation paramétrique, FaceIDGraph
** Generic naming in generative, constraint-based design
nommage persistant
** Semantic feature modelling
les systèmes de modélisation paramétrique et basée sur l'historique ne proposent
pas de spécification complète pour la sémantique des éléments d'un modèle. Ainsi
lors de la modélisation, le système échoue à maintenir l'unicité d'une entité
topologique par son nom.
** Identification of topological entities and naming mapping for parametric cad model exchange
échange de modèle, nommage persistant, nom secondaire pour résoudre les
problèmes d'ambigüité
** A persistent naming of shell
Les outils actuels ne propose des solutions de nommage que pour les cellules
atomiques (sommet, arêtes, faces). Cette contribution propose un cadre complet
pour l'identification persistante de "coquilles", des agrégats de faces.
** Generic computation of bulletin boards into geometric kernels
Les noyaux de modélisation, par nécessité, tracent tous les changements
topologiques affectant un modèle tout au long de sa construction. À terme de
chaque opération, un journal de modification listant tous les changements
(création, suppression, scission, fusion), doit être produit. Cette contribution
propose une méthode générique (et non propriétaire) de calcul de journal
d'événements.
** Graph transformation library for topology-based geometric modeling
La plupart des logiciels de modélisation géométrique utilisent un modeleur
ad-hoc. Ce papier propose un modeleur à base topologique qui, contrairement aux
autres, propose la définition d'opérations qui ne sont pas décrite par un
language de programmation de bas niveau mais comme des règles de transformation
de graphe éditable simplement et graphiquement.
** Enhancements for Improved Topological Entity Identification Performance in Multi-user CAD
La plupart des systèmes de nommage échouent à identifier efficacement un grand
nombre d'éléments topologiques. Ce besoin, lors de conception MultiCAD est très important.
Ce papier propose une méthode de nommage paresseux pour répondre à cette difficulté.
** General physical-topological framework using rule-based language for physical simulation
Cette contribution propose un outil de simulation de la physique à l'aide d'un
modeleur ad-hoc conçu avec Jerboa.
